<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>

	<head>
		<meta http-equiv="content-type" content="text/html;charset=ISO-8859-1">
		<meta name="generator" content="Adobe GoLive 6">
		<title>E.W.Dijkstra Archive: Interview Prof. Dr. Edsger W. Dijkstra, Austin, 04-03-1985</title>
	</head>

	<body bgcolor="#ffffff">
		<div align="right">
			&nbsp;<a href="vanVlissingenInterview.pdf" target="_blank">original PDF</a></div>
		<div align="left">
			<p>Entrevista al Profesor Dr. Edsger W. Dijkstra, Austin, 03-04-1985<br>
				&copy;Rogier F. van Vlissingen</p>
			<p><u>Detalles Biogr&aacute;ficos</u></p>
			<ul>
				<li type="disc">1930: Nace en R&oacute;tterdam, Holanda
				<li type="disc">1948-1956: Estudia Matem&aacute;ticas y F&iacute;sica Te&oacute;rica en la Universidad de Leyden
				<li type="disc">1952-1962: Trabaja en el Mathematical Center de &Aacute;msterdam &#150; el primero que figura como<br>
					programador en la n&oacute;mina de pagos				<li type="disc">1957: Se casa &#150;el juez de paz no acepta programador como profesi&oacute;n para el registro, en lugar<br>
					de esto se usa f&iacute;sico te&oacute;rico				<li type="disc">1962-1973: Profesor de Matem&aacute;ticas en la Universidad de Eindhoven, en Holanda
				<li type="disc">1973-1984: Se desempe&ntilde;a como investigador colega en Burroughs y como Profesor Extraordinario<br>
					en Eindhoven &#150; &#147;El laboratorio de desarrollo m&aacute;s peque&ntilde;o de Burroughs era mi estudio&#148;			<li type="disc">1984: Profesor y Schlumberger Centennial Chair de ciencias de la computaci&oacute;n en la <br>
					Universidad de Tejas en Austin.			</ul>
			<table width="614" border="0" cellspacing="0" cellpadding="5">
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Tomando algunas de sus dr&aacute;sticas declaraciones sobre la calidad del software, &iquest;est&aacute; cambiando de alg&uacute;n modo, progresamos hacia mejores productos?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Eso depende, en los &uacute;ltimos quince a&ntilde;os la brecha entre las ciencias de la computaci&oacute;n y nuestras mejores industrias se ha reducido, al igual que con las pr&aacute;cticas industriales.  Se ha reducido mucho.  Esto se debe, en gran parte a que las ciencias de la computaci&oacute;n en las universidades hayan avanzado tanto.  Ahora la industria est&aacute; empleando personal m&aacute;s joven que cuenta con una mejor preparaci&oacute;n que con la que se contaba en el pasado. A lo largo de los a&ntilde;os he realizado varias presentaciones sobre programaci&oacute;n alrededor del mundo y la reacci&oacute;n m&aacute;s com&uacute;n en la audiencia ha sido: &#147;Qu&eacute; pena que mi jefe no est&eacute; aqu&iacute;.&#148;  Es un comentario muy triste, pero la moraleja de la historia es que las pr&aacute;cticas industriales sufren, mayoritariamente, debido al conservadurismo e incompetencia t&eacute;cnica de los gerentes de estos proyectos.  Sin embargo, si se pudiera cambiar la organizaci&oacute;n interna y jerarqu&iacute;a de las organizaciones de la industria de la programaci&oacute;n, habr&iacute;a lugar para grandes progresos.  Y creo que va a cambiar, porque la presi&oacute;n que llega de abajo se vuelve m&aacute;s y m&aacute;s fuerte.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">En la pr&aacute;ctica, la presi&oacute;n de la producci&oacute;n parece recompensar a la programaci&oacute;n inteligente por sobre la buena programaci&oacute;n: &iquest;Qu&eacute; tanto estamos progresando hacia el caso en el que la buena programaci&oacute;n tambi&eacute;n sea efectiva en lo que respecta al costo?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Bueno, se ha dicho una y otra vez que el tremendo costo de programaci&oacute;n es consecuencia de la mano de obra barata, lo que la vuelve muy costosa, y porque la gente se apresura a codificar.  Una de las cosas que la gente aprende en las universidades hoy en d&iacute;a es a pensar primero; lo que vuelve al desarrollo m&aacute;s efectivo en t&eacute;rmino de costos.  Conozco al menos una empresa de software en Francia, y debe de haber otras por lo que esta historia tiene un par de a&ntilde;os, en la que existe una regla estricta  por la que no se permite comenzar la codificaci&oacute;n en tanto no haya transcurrido un setenta por ciento del tiempo pactado, cualquiera sea el software que deban entregar. As&iacute; que si despu&eacute;s de nueve meses un equipo de proyecto reporta a su jefe que quieren comenzar a codificar, &eacute;l les preguntar&aacute;: &#147;&iquest;Est&aacute;n seguros que no queda otra cosa por hacer?&#148;  Y si ellos dicen que s&iacute;, se les dir&aacute; que el producto ser&aacute; despachado en tres meses.  Esa compa&ntilde;&iacute;a es muy exitosa.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Existe la percepci&oacute;n de que la difusi&oacute;n de las computadoras personales conlleva una pretendida alfabetizaci&oacute;n inform&aacute;tica.  La &#145;revoluci&oacute;n de la PC&#146; debiera preparar m&aacute;s al usuario laico para soluciones basadas en computadoras y ayudar&iacute;a al progreso del uso de las computadoras en las corporaciones.  &iquest;Hay sustancia en esta percepci&oacute;n o quiz&aacute;s este  desarrollo est&eacute; embarrando las aguas?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Dos comentarios respecto de esta pregunta.  Uno es que su punto de vista de los programas industriales as&iacute; como lo presenta en la pregunta es acotado.  Hay todo tipo de programas que dif&iacute;cilmente tengan usuarios, si piensa en una transacci&oacute;n telef&oacute;nica, o los controles digitales en los autom&oacute;viles o aeroplanos.  En cuanto a los productos de programaci&oacute;n que son usados por personas, apenas tengo experiencia de primera mano; mi impresi&oacute;n es que una enorme cantidad del tiempo del usuario se pierde en figurarse lo que el programa hace y c&oacute;mo controlarlo.  Es la consecuencia de dos tipos de acontecimiento: Primero que nada que los dise&ntilde;adores han fallado en mantener tan simple como se pueda la interfase del sistema. &#150; lo que es un desaf&iacute;o; pero tan pronto se da cuenta uno de que el mayor desaf&iacute;o en las ciencias de la computaci&oacute;n es como no perderse en las complejidades de su propia ficci&oacute;n, se vuelve claro que &eacute;sta es una tarea de importancia.  Por otra parte la escena se ve enturbecida por el hecho de que un gran porcentaje de la gente involucrada son analfabetos funcionales; particularmente en los Estados Unidos.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Realmente piensa que esto es as&iacute;, m&aacute;s aqu&iacute; que en Holanda?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Ah s&iacute;.  En Europa una parte mucho m&aacute;s grande de la poblaci&oacute;n puede escribir.  Las personas en Norteam&eacute;rica han sufrido realmente la combinaci&oacute;n de la televisi&oacute;n, lo que vuelve a la lectura algo superfluo, y el tel&eacute;fono.  Hace algunos a&ntilde;os, cuando estaba en CalTech, y estoy hablando de un lugar de alta calidad que todos recomiendan porque sus estudiantes son tan brillantes, un graduado me confes&oacute; &#150; no es que lo haya confesado, sino que declar&oacute; que no le preocupaba su escritura, ya que se estaba preparando para una carrera industrial.  &iexcl;Pobre industria!</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Lo que nos lleva a otra pregunta: &iquest;Hay, en la producci&oacute;n de software&#133;?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Yo prefiero usar el t&eacute;rmino dise&ntilde;o de software, ya que es un producto abstracto.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Bien.  &iquest;Existe alguna diferencia significativa entre lo que sucede en Europa y en este pa&iacute;s con respecto al dise&ntilde;o de software?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">La hay.  Las ciencias de la computaci&oacute;n en Norteam&eacute;rica, cuando pr&aacute;cticas, se mantienen muy cerca de la m&aacute;quina en s&iacute;, en tanto que te&oacute;ricas se vuelven mucho m&aacute;s te&oacute;ricas; y aqu&iacute; yace mi fascinaci&oacute;n personal por este punto, ya que el &aacute;rea de superposici&oacute;n entre lo te&oacute;rico y lo pr&aacute;ctico es inmensa.  Lo que parece estar bien desde un punto de vista te&oacute;rico suele ser eminentemente &uacute;til, y lo que es realmente bueno de una idea pr&aacute;ctica implica siempre algo profundo que le subyace.  Y mi fascinaci&oacute;n con este punto es que existe una gran &aacute;rea donde las distinciones tradicionales entre lo puro y lo aplicado son insignificantes.  Siempre me opuse a ser llamado un cient&iacute;fico puro de la programaci&oacute;n si eso implica que soy poco pr&aacute;ctico.  Siempre me opuse a ser llamado un cient&iacute;fico pr&aacute;ctico de la computaci&oacute;n si eso significa que lo que hago es algo vago o vac&iacute;o desde un punto de vista te&oacute;rico.  La s&iacute;ntesis entre puro y aplicado; donde la distinci&oacute;n desaparece, es m&aacute;s acogida en la escena europea que aqu&iacute;.  Tradicionalmente la distinci&oacute;n entre matem&aacute;tica pura y aplicada es fuerte en los Estados Unidos.  Un ejemplo sencillo de este hecho puede apreciarse en que las universidades aqu&iacute; tienen departamentos separados para las matem&aacute;ticas puras y, digamos, investigaci&oacute;n de estad&iacute;sticas y operaciones.  Una separaci&oacute;n de este estilo ser&iacute;a desatendida en la mayor&iacute;a de las universidades europeas.  Por otra parte, la industria norteamericana de la computaci&oacute;n tiene m&aacute;s peso, y como resultado se aprecia una tendencia a ver la computaci&oacute;n en un contexto exclusivamente industrial.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top"> &iquest;Y esta diferencia guarda alguna relaci&oacute;n con los productos desarrollados en Europa con respecto a sus equivalentes de los Estados Unidos &#150;hablando de productos que son usados por personas; ser&iacute;an m&aacute;s amistosos con el usuario, para usar el t&eacute;rmino de moda?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">La amistad con el usuario es un t&eacute;rmino que no debiera haberse inventado nunca.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Qu&eacute; palabra hubiese usado para connotar la idea?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">&iexcl;La idea est&aacute; mal!  Es una larga historia sobre el usuario, que voy a tratar de condensar.  El punto es que el usuario de la computadora, en el marco del desarrollo de productos para computadoras, no es una persona real de carne y hueso sino una figura literaria; la creaci&oacute;n de la literatura, m&aacute;s bien de una literatura pobre.  Hace 15 a&ntilde;os not&eacute; que los cient&iacute;ficos de la computaci&oacute;n holandeses que desarrollaban productos, al referirse a las necesidades de un usuario usaban &#150; en la mitad de una sentencia en holand&eacute;s &#150; la palabra user; la cual puede, por supuesto, traducirse perfectamente, como usted y yo sabemos.  Nuestros paquetes de cigarrillos tienen ingl&eacute;s tambi&eacute;n&#133;&#133;&#133;.; pero entonces descubr&iacute; que, a pesar de su anglofobia, la palabra user es perfecto franc&eacute;s.  Y tambi&eacute;n descubr&iacute; que es perfecto ruso y que nosotros dos sabemos m&aacute;s japon&eacute;s de lo que usted piensa.  Bueno, el hecho de que esa peque&ntilde;a palabra no se traduzca, sino que se mantenga en su cuerpo for&aacute;neo en las discusiones en holand&eacute;s, franc&eacute;s, ruso y japon&eacute;s, significa que ha perdido su sentido original.  Ahora, si usted empieza a analizar las muchas envestiduras de esa figura literaria, llegar&aacute; a descubrir que el pretendido usuario es algo desesperanzador.  Resulta est&uacute;pido, resistente sino es que inmune a la educaci&oacute;n, odia cualquier forma de demanda intelectual que caiga sobre &eacute;l; no puede gozar de algo hermoso, porque le falta educaci&oacute;n para apreciar la belleza.  Una gran parte de las ciencias de la computaci&oacute;n est&aacute; paralizada por aceptar a este est&uacute;pido como su usuario tipo.  Pocas son las compa&ntilde;&iacute;as que est&aacute;n preparadas para hacer un Mercedes, el an&aacute;logo a un producto de alta categor&iacute;a para el usuario exigente.  Por lo que puede apreciarse, particularmente en los Estados Unidos, las matem&aacute;ticas son el pin&aacute;culo de la enemistad con el usuario. Si usted lee los cat&aacute;logos de las editoriales de libros de texto, notar&aacute; que la recomendaci&oacute;n m&aacute;s trascendente que le dan a un libro es que sea a-matem&aacute;tico, que no requiera conocimientos matem&aacute;ticos, etc.  As&iacute; que, la amistad con el usuario es, entre otras cosas, la causa de un error fren&eacute;tico por ocultar el hecho de que las computadores son m&aacute;quinas matem&aacute;ticas de por s&iacute;.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Qu&eacute; debiera hacerse por la industria para salir de este punto muerto?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Puede que no sea posible.  Hace cinco o seis a&ntilde;os Harlan B.Mills expuso falsamente que la industria de la computaci&oacute;n, los usuarios de las computadoras y las instituciones educacionales estaban en una situaci&oacute;n de completo estancamiento.  La industria no se siente responsable de educar a su gente, porque son extremadamente conservadores con sus productos; y as&iacute; se pautan las demandas del usuario dentro de la industria.  Las universidades no se animan a cubrir las cosas reales en su programa universitario porque la industria y los futuros empleadores no est&aacute;n esperando que eso suceda.  Su conclusi&oacute;n fue que romper con este punto muerto era una responsabilidad federal.  Yo pienso que las universidades pueden; y si no lo hacen es porque han olvidado su rol.  &iquest;Qu&eacute; implica ser una instituci&oacute;n destacada?  Lo que m&aacute;s hace falta es: que un par de buenas universidades cuenten con s&oacute;lidos y anticuados departamentos de ciencias de la computaci&oacute;n.  Ya sea que esto est&eacute; planeado o no, pienso que algunos profesores de ciencias de la computaci&oacute;n no ser&aacute;n suprimidos.  No pueden ser domesticados para que presenten un mont&oacute;n de basura a sus alumnos.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Y usted intenta ser uno de estos que no ser&aacute;n suprimidos&#133;?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">&iexcl;Nunca lo he sido!</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Y su traslado a los Estados Unidos tiene un significado especial en esta lucha de liberaci&oacute;n?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">No, porque llevo adelante mi trabajo de la misma manera que antes.  Recib&iacute; una oferta muy buena y la raz&oacute;n por la que la acept&eacute; fue que en el curso de once a&ntilde;os de trabajo con Burroughs Corp. &#150; once a&ntilde;os maravillosos, por los que estoy muy agradecido con la compa&ntilde;&iacute;a &#150; mi inter&eacute;s se proyect&oacute; m&aacute;s all&aacute; de las necesidades t&eacute;cnicas de la industria de la computaci&oacute;n.  Al menos de la manera en que la industria de la computaci&oacute;n los percib&iacute;a.  Entonces sent&iacute; que un regreso al campus universitario ser&iacute;a apropiado.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Son los Estados Unidos el para&iacute;so de las ciencias de la computaci&oacute;n tal que presumen ser?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">
				No.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Por qu&eacute; dice eso?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Porque est&aacute;n en riesgo de ser apoyadas a muerte.  No son, de seguro, un para&iacute;so para las ciencias de la computaci&oacute;n.  Una de las cosas que debe hacer un cient&iacute;fico de la computaci&oacute;n es  distinguir entre los problemas espec&iacute;ficos de la ciencia de la computaci&oacute;n y el uso de las computadoras en la sociedad.  Y entonces debemos distinguir claramente entre los problemas de las ciencias de la computaci&oacute;n y aquellos generados por el sistema educativo.  Debemos tambi&eacute;n separar claramente los problemas de las ciencias de la computaci&oacute;n de aquellos generados por el contacto entre la industria y los consumidores.  La satisfacci&oacute;n del usuario no es un criterio de calidad para un producto de la computaci&oacute;n.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Qu&eacute; le hace decir eso?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Hace a&ntilde;os me presentaron la satisfacci&oacute;n del cliente como un criterio de calidad y me pareci&oacute; rid&iacute;culo.  Es algo que se puede conseguir de muchas maneras.  Por ejemplo, al no educar a los clientes, dici&eacute;ndoles que no puede hacerse algo mejor; postulando que el hecho de que los programas tengan errores es una ley natural.  Hasta se lo puede conseguir por intimidaci&oacute;n.  Lo peor de todo es que el objetivo es demasiado difuso como para dar asistencia t&eacute;cnica.  No, la satisfacci&oacute;n del usuario como criterio es t&iacute;picamente norteamericana, porque el punto de contacto entre el proveedor y sus consumidores en Norteam&eacute;rica est&aacute; en que los proveedores dejan las &uacute;ltimas instancias de control a cargo de los consumidores.  Por eso es que puede verse tanto la frase &#147;satisfacci&oacute;n garantizada y sino puede devolverlo&#148;: lo remendar&iacute;an indefinidamente.  Algo ha pasado con el dise&ntilde;o de lenguajes de programaci&oacute;n.  Los lenguajes de programaci&oacute;n deben ser, por supuesto, amistosos con el usuario, a los programadores deben gustarles.  Durante mucho tiempo las caracter&iacute;sticas de los lenguajes de programaci&oacute;n se inclu&iacute;an en los lenguajes de acuerdo a su supuesta popularidad &#150; el criterio principal era si a la gente le iba a gustar o no &#150; partiendo otra vez de una triste percepci&oacute;n del usuario.  El gran cambio en los lenguajes de programaci&oacute;n vino cuando empezamos a dar definiciones formales a la sem&aacute;ntica de los conceptos de los lenguajes de programaci&oacute;n.  Algo que hace falta si se quieren probar cosas sobre los programas escritos en &eacute;l.  Y a&uacute;n si no se espera conseguirlo de una manera formal, es un ejercicio extremadamente saludable para los dise&ntilde;adores de lenguajes de programaci&oacute;n.  La formalizaci&oacute;n actu&oacute; como un sistema de alerta temprana: si la definici&oacute;n formal de una caracter&iacute;stica se vuelve confusa y complicada, entonces no se debe ignorar esa advertencia.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Puede explicar algo m&aacute;s sobre estos desarrollos del lenguaje que brindan mejores caracter&iacute;sticas?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Las versiones de los lenguajes con los que est&aacute;n experimentando los cient&iacute;ficos de la computaci&oacute;n no se seleccionan por su potencial atractivo para los ineducados, sino que son evaluados con criterios tales como el del poder matem&aacute;tico, en un sentido muy riguroso, la elegancia matem&aacute;tica y este tipo de investigaci&oacute;n ha producido toda clase de cosas.  Algunos se mantienen dentro del marco de los lenguajes imperativos porque sabemos muy bien como implementarlos de manera eficiente.  Otros est&aacute;n explorando lenguajes de programaci&oacute;n funcionales.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Puede explicar la diferencia entre estos dos?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">En un minuto voy a intentarlo.  Otros est&aacute;n siendo menos constructivos en sus consideraciones.  Definen las respuestas a partir de un conjunto de operaciones l&oacute;gicas, dejando a la implementaci&oacute;n la tarea de descubrir la soluci&oacute;n a ese conjunto de ecuaciones.  El efecto neto de esto es que un sistema completo para la programaci&oacute;n que sea realmente aceptable; ser&aacute; a la vez un sistema completo que cumplir&aacute; con la descripci&oacute;n de la matem&aacute;tica constructiva.  Lo que est&aacute; pasando es que la brecha entre el programa que una computadora pueda ejecutar y la prueba matem&aacute;tica de que esa respuesta exista se est&aacute; reduciendo.<br>
						La manera m&aacute;s sencilla de caracterizar la diferencia entre un lenguaje imperativo de programaci&oacute;n y uno que no lo sea es que al razonar sobre la programaci&oacute;n imperativa se debe estar al tanto del &#145;estado&#146; de la m&aacute;quina a medida que se graba en su memoria.  En conjunci&oacute;n con esto existe una clara diferencia entre el programa que se tiene, por una parte y la informaci&oacute;n procesada por la otra.  En el caso de la programaci&oacute;n funcional se crea un lenguaje en el cual se puede escribir todo tipo de expresiones y para evaluar una expresi&oacute;n se la masajea hasta alcanzar la forma esperada.<br>
					</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Se est&aacute; refiriendo a la vanguardia de la investigaci&oacute;n de lenguajes de computadora&#133;</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">S&iacute;.  Lo que se encuentra otra vez en peligro de ser apoyado a muerte ya que una de las esperanzas de la programaci&oacute;n funcional es que en la ejecuci&oacute;n de programas escritos en un estilo funcional se puede explotar la concurrencia en gran medida y de una manera m&aacute;s sencilla.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Y qu&eacute; tanto de estas investigaciones est&aacute;, a este punto, volc&aacute;ndose en las aplicaciones industriales?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Poco, pero m&aacute;s de lo que usted piensa.  Conozco un entorno industrial, por dar un ejemplo, de una enorme casa de software que forma parte de una compa&ntilde;&iacute;a petrolera y cuyo prop&oacute;sito principal es satisfacer las demandas de la empresa matriz, as&iacute; que podemos decir que es un entorno definitivamente industrial; el caso es que al comenzar un programa nuevo desarrollan un prototipo utilizando un lenguaje de programaci&oacute;n funcional en un tiempo sorprendentemente corto.  De hecho en menos de un d&eacute;cimo del tiempo que hubiese requerido otra t&eacute;cnica de programaci&oacute;n.  Ellos cuentan con una implementaci&oacute;n de este lenguaje de programaci&oacute;n funcional, pero podemos decir que no es muy buena; como resultado de esto el prototipo acaba siendo inaceptablemente lento, pero la experiencia acaba restituy&eacute;ndolo como un muy importante paso intermedio hacia el producto final.  As&iacute; que hemos visto que, aunque invisible en el producto final, los nuevos lenguajes de programaci&oacute;n y las t&eacute;cnicas de implementaci&oacute;n est&aacute;n empezando a jugar un papel detr&aacute;s de escena.  Esto impactar&aacute; profundamente en la comunidad del software &#150; usted ver&aacute;, el punto es que cuando quiera beneficiarse de la disponibilidad de la m&aacute;quina en el desarrollo de programas, obviamente los primeros candidatos para la automatizaci&oacute;n ser&aacute;n aquellos procesos m&aacute;s o menos rutinarios.  Como resultado lo m&aacute;s dif&iacute;cil del asunto permanece.  Con nuestras as&iacute; llamadas herramientas de programaci&oacute;n el efecto neto es que la programaci&oacute;n se vuelve cada vez m&aacute;s dificultosa.  Las partes sencillas se automatizan y lo dificultoso se mantiene y alcanza el nivel en el que le requiere al desarrollador de software un cierto nivel de sofisticaci&oacute;n matem&aacute;tica.  Hace un tiempo presenci&eacute; una discusi&oacute;n acalorada que involucraba un mont&oacute;n de las as&iacute; llamadas funciones de orden alto &#150; las funciones de orden alto son consideradas demasiado extravagantes por muchos matem&aacute;ticos como para siquiera hablar de ellas, son funciones que toman funciones como par&aacute;metros y pueden llegar a devolver una funci&oacute;n como valor &#150; era un grupo de cient&iacute;ficos industriales de la computaci&oacute;n y hablaban sobre las funciones de orden alto como si fuese la cosa m&aacute;s normal del mundo.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">As&iacute; que est&aacute; pasando&#133;</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Est&aacute; pasando, &iexcl;S&iacute;!  Si tuviese que tomar un grupo de mis colegas de la matem&aacute;tica tradicional y les expusiera esta discusi&oacute;n, no tendr&iacute;an la m&aacute;s m&iacute;nima noci&oacute;n de lo que ocurre, y si la tuviesen no lo podr&iacute;an creer.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Pareciera como si las mejoras en efectividad de las que hablaba se estuviesen ganando r&aacute;pidamente la atenci&oacute;n de todo el mundo &#150; As&iacute; que&#133; nuevamente: &iquest;Cu&aacute;ndo se percibir&aacute; este impacto?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Usted conoce la respuesta que dio Max Planck cuando le preguntaron cuando ser&iacute;a aceptada por los f&iacute;sicos la mec&aacute;nica cu&aacute;ntica&#133; &#147;&iexcl;Cuando la generaci&oacute;n actual de f&iacute;sicos haya muerto!&#148;</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Esto nos deja alguna esperanza?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">S&iacute;.  Debemos tener en cuenta que en cualquier campo el per&iacute;odo de tiempo: la demora que ocurre entre un progreso cient&iacute;fico significativo y su aceptaci&oacute;n por parte de la comunidad cient&iacute;fica en su mayor&iacute;a, sin mencionar el momento en el que encuentra su camino hacia la producci&oacute;n, se mide en generaciones.  Las razones de mi desacuerdo con la manera en que he sido educado &#150; en t&eacute;rminos generales estoy extremadamente contento con mi educaci&oacute;n &#150; son que nadie me advirti&oacute; sobre este per&iacute;odo de tiempo de un par de generaciones, tuve que descubrirlo por mi cuenta y por medio de mucha frustraci&oacute;n.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Qu&eacute; es lo que est&aacute; pasando con la generaci&oacute;n de los estudiantes actuales a los que se refer&iacute;a anteriormente, que traen consigo algunos de estos conceptos, o incluso algunos de estos productos?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Hace mas o menos veinte a&ntilde;os llegu&eacute; a la conclusi&oacute;n de que las &uacute;nicas personas que llegara a educar se convertir&iacute;an en inadaptados.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Esto le deja alguna esperanza a la industria?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Ah s&iacute;, el punto es que nosotros educamos a los cient&iacute;ficos, quienes educan a la industria; preparando a la industria para poder emplearlos.  El atraso de la industria no es un problema cient&iacute;fico.  La industria est&aacute; comenzando a percibir los problemas causados por su propia inercia; por supuesto que esto tom&oacute; mucho tiempo.  La gente est&aacute; reaccionando, ya sea que resulte fruct&iacute;fero o no, nadie sabe&#133; &iexcl;General Motors quiere desarrollar el pr&oacute;ximo auto en una compa&ntilde;&iacute;a completamente nueva!</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Entonces est&aacute; diciendo que este camino se tom&oacute; para romper con esa inercia?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Seguro.  Es una manera de empezar de nuevo.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">En lo que respecta a cooperaci&oacute;n entre la industria y la investigaci&oacute;n universitaria, &iquest;cree que las cosas se hagan mejor aqu&iacute; o en Holanda?  &iquest;O es que pueden llegar a aprender uno del otro?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Me resulta dif&iacute;cil juzgar eso, porque desde que estoy aqu&iacute; no he tenido experiencia en la cooperaci&oacute;n con la industria.  Una de las razones por las cuales me un&iacute; a Burroughs Corp. como investigador colega en el 73 fue que en la d&eacute;cada precedente hab&iacute;a observado que era extremadamente dif&iacute;cil penetrar en la industria desde el campus, desde afuera.  En los diez a&ntilde;os posteriores descubr&iacute; que era dif&iacute;cil desde dentro tambi&eacute;n, aunque un poco m&aacute;s sencillo.  Esto se aplica a la industria a ambos lados del Atl&aacute;ntico.  Es mucho m&aacute;s com&uacute;n que aqu&iacute; la industria apoye la investigaci&oacute;n individual &#150; este siempre fue el caso.  Es muy probable que un profesor universitario sea tambi&eacute;n consultor, pero muchos consultores hacen lo suyo.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Usted piensa que Holanda deba aprender del enfoque norteamericano?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Mi impresi&oacute;n general es que no importa el error que se cometa en los Estados Unidos, ser&aacute; copiado fielmente en Europa veinte a&ntilde;os despu&eacute;s.  Europa puede aprender una enorme cantidad de los Estados Unidos; al estudiar lo que pasa all&iacute; y no copiarlo.  En algunos aspectos puede que intentemos copiarlo de todos modos.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;En qu&eacute; est&aacute; pensando espec&iacute;ficamente?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">O, la facilidad con la que puede incorporar, creo que cuesta algo as&iacute; como tres d&oacute;lares&#133;</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Considerando los posibles avances, &iquest;estamos en este momento limitados por la tecnolog&iacute;a, por las t&eacute;cnicas de programaci&oacute;n o quiz&aacute;s por ambas?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">John McCarthy de la universidad de Standford hizo un comentario hace mucho tiempo, y sigue siendo v&aacute;lido, en el que afirmaba que el cuello de botella m&aacute;s importante no se encuentra en el hardware sino en nuestra habilidad para la programaci&oacute;n.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Hablando de cuellos de botella en la programaci&oacute;n &#150; &iquest;Cu&aacute;l ser&aacute; el impacto de la investigaci&oacute;n en inteligencia artificial?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">&iquest;Se puede investigar algo que no sea ciencia?  Siento que el esfuerzo por usar m&aacute;quinas para imitar el razonamiento humano es a la vez insensato y peligroso.  Es insensato porque si se le echa un vistazo al razonamiento humano resulta bastante pobre; a&uacute;n lo matem&aacute;ticos m&aacute;s entrenados son pensadores principiantes.  En lugar de intentar imitar aquello en lo que somos buenos, pienso que es mucho m&aacute;s fascinante investigar aquello en lo que nos desempe&ntilde;amos pobremente, es insensato usar m&aacute;quinas para imitar a los seres humanos, en tanto que las m&aacute;quinas son realmente buenas siendo m&aacute;quinas, y esto es algo en lo que los seres humanos somos malos.  Cualquier proyecto de inteligencia artificial exitoso castra a la m&aacute;quina por su propia naturaleza.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Las ciencias de la computaci&oacute;n se han vuelto muy populares, hay muchos estudiantes, hay muy pocos &#150; puede percibir un cambio en el nivel de preparaci&oacute;n de los estudiantes que ingresan ahora con respecto a digamos, diez a&ntilde;os atr&aacute;s?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">El asunto es devastadoramente popular.  Porque ahora se supone que la computaci&oacute;n puede curar todos los males del mundo y m&aacute;s.  Una vez present&eacute; un resumen en el que remarcaba qu&eacute;, a trav&eacute;s de los siglos, el esfuerzo cient&iacute;fico ha sido un completo desastre.  El primer esfuerzo cient&iacute;fico fue, por supuesto, la producci&oacute;n del elixir que diera la juventud eterna; pero luego notaron que no ten&iacute;a mucho sentido vivir eternamente si eso significaba vivir en la eterna pobreza; as&iacute; que el siguiente gran proyecto cient&iacute;fico fue como convertir cualquier cosa en oro.  Y entonces fue bastante claro que la concreci&oacute;n de estos dos grandes proyectos quedaba fuera del alcance de los videntes del momento.  As&iacute; que, por que por simples razones administrativas el plato del d&iacute;a pas&oacute; a ser la predicci&oacute;n acertada del futuro.  A medida que pasaba el tiempo los objetivos iniciales se fueron olvidando.  La medicina se divorci&oacute; de la curander&iacute;a, la qu&iacute;mica se divorci&oacute; de la alquimia y la astronom&iacute;a de la astrolog&iacute;a.  Sin embargo a&uacute;n hay un cierto sentimiento de culpa en la comunidad acad&eacute;mica; en cuanto emerge una nueva rama de la tecnolog&iacute;a recibe la carga de todas las viejas esperanzas.  El fen&oacute;meno actual de la computaci&oacute;n es un reflejo inmediato de esperanzas absolutamente irreales.  As&iacute; que si me pregunta si hay demasiados o demasiado pocos estudiantes: dir&iacute;a que son un orden de magnitud demasiados.  Desde un punto de vista cient&iacute;fico, podr&iacute;a preferirse desmalezar el lote para quedarse con el 2% m&aacute;s brillante y hacer negocios.  La generaci&oacute;n actual de j&oacute;venes no s&oacute;lo ha sido mal preparada, sino que ha sido mal guiada.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Est&aacute; sugiriendo que el fen&oacute;meno de las computadoras personales ha tenido un efecto poco favorable m&aacute;s que&#133;?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">S&iacute;.  Lo he dicho en p&uacute;blico y estoy dispuesto a repetirlo, que si alguien es introducido al mundo de la computaci&oacute;n a trav&eacute;s del Basic quedar&aacute; mentalmente mutilado y sin posibilidad de redenci&oacute;n.  Y esto no es una  broma.  Una gran rama de la Academia de Artes y Ciencias Siberiana se aplica a mantener al Basic fuera de las escuelas secundarias siberianas.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Y que es lo que entra en estas escuelas?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Probablemente Basic.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;De los dem&aacute;s lenguajes que se est&aacute;n volviendo populares, hay alguno que ofrezca alguna esperanza?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">O s&iacute;, la popularidad de Pascal es prometedora.  No porque sea ideal, pero porque es mejor en ordenes de magnitud con respecto a sus competidores.  Por otra parte se trata de un producto de un solo hombre, sin ning&uacute;n tipo de patrocinio pol&iacute;tico o industrial.  Ha ganado en popularidad a lo largo de una d&eacute;cada, porque al momento de su aparici&oacute;n era mucho mejor que cualquier otra cosa que estuviese disponible.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Hemos visto a Lisp emerger en construcciones de documentaci&oacute;n?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top"> Lisp fue algo grandioso al momento de su aparici&oacute;n por su manera radicalmente nueva de hacer uso de las m&aacute;quinas.  Ha sufrido el destino de haber sido elevado a un estado de est&aacute;ndar de facto con todos sus defectos.  M&aacute;s all&aacute; de la novedad conceptual gran parte del dise&ntilde;o de Lisp es incre&iacute;blemente pobre a&uacute;n para el nivel de la &eacute;poca.  Cuando le&iacute; el primer manual,  el manual de Lisp 1.5 publicado en 1961, no pude creer lo que le&iacute;a.  Era un lenguaje extremadamente pobre.  Ahora se ha convertido en el est&aacute;ndar de facto para la comunidad de inteligencia artificial, que sufre con Lisp lo que el resto del mundo ha sufrido con Fortran.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">&iquest;Las ciencias de la computaci&oacute;n se est&aacute;n acercando a la madurez en alg&uacute;n sentido, o d&oacute;nde estamos nosotros?</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Bueno, nosotros somo un lote bastante mezclado &iquest;no lo somos?  Voy a citar tres fechas: 1968, 1975 y 1984.  En 1968 IBM publica un anuncio en Datamation en el que muestra a Suzie Meyer sonriendo a todo color.  Suzie Meyer anuncia que ha resuelto todos sus problemas de programaci&oacute;n por el simple hecho de cambiarse a la PL/1.  &iexcl;Es una gran pena que Datamation no haya publicado una foto de Suzie Meyer cuatro a&ntilde;os despu&eacute;s!<br>
						1975 fue el a&ntilde;o en el cual el l&oacute;gico sueco Per Martin-L&ouml;f se convenci&oacute; del hecho de que un programa bien documentado era un objeto l&oacute;gicamente isomorfo con una prueba de matem&aacute;tica constructiva.  En ese sentido la palabra constructiva se refiere a la m&aacute;s pura de todas las matem&aacute;ticas.<br>
						Para 1984 las ciencias de la computaci&oacute;n se han percatado de esto.  Para finales de 1983 presenci&eacute; una peque&ntilde;a conferencia industrial sobre la programaci&oacute;n.  Un mensaje se oy&oacute; a viva voz y declaraba que en el desarrollo de los programas las t&eacute;cnicas formales no s&oacute;lo ser&iacute;an esenciales, sino que ser&iacute;an aplicadas en una escala sin precedentes.  Bien, si compara entonces con ahora hemos recorrido un gran tramo.<br>
					</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30"></td>
					<td align="left" valign="top"></td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">P</td>
					<td align="left" valign="top">Para finalizar quiero preguntarle cu&aacute;l es el proyecto de investigaci&oacute;n m&aacute;s interesante del momento, si es que puede nombrar alguno.</td>
				</tr>
				<tr>
					<td align="left" valign="top" width="30">R</td>
					<td align="left" valign="top">Puedo nombrar s&oacute;lo uno y a grandes rasgos.  Y es como incrementar nuestro poder de razonamiento en &oacute;rdenes de magnitud y aplicarlo como una parte de la t&eacute;cnica formal en una escala sin precedentes.  Creo firmemente que el potencial impacto de la computadora en las matem&aacute;ticas en general ser&aacute; tan profundo en el siglo por venir como lo ha sido la influencia de la f&iacute;sica en el an&aacute;lisis en el siglo pasado.</td>
				</tr>
			</table>
		</div>
		<hr>
		<font size="-1">translated by Mariano Cerrutti<br>
			
			revised <csobj format="MedDate" h="16" region="15" t="DateTime" w="89">Wed, 19 Jul 2006</csobj></font>
	</body>

</html>